Revit 2026 API

# MEPModel Methods

---

The MEPModel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAssignedElectricalSystems | Retrieves the electrical systems this electrical panel currently is assigned to. |
|  | GetElectricalSystems | Retrieves the electrical systems that are currently created using this MEPModel. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

MEPModel Class

Autodesk.Revit.DB Namespace